## Setup

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
sns.set_theme()
import datetime as dt

import utils_04 as utils

%load_ext autoreload
%autoreload 2

## 01 Loading Data

In [7]:
jb = utils.JamesBond()  # James Bond instance
jb.bond.head()

,Film,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
0,Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
1,From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
2,Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
3,Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7
4,Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [8]:
jb.bond.shape

(27, 7)

## 02 Index

In [10]:
jb.bond.set_index('Film').head()

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [18]:
jb.bond.set_index('Film').reset_index().head()

,Film,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
0,Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
1,From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
2,Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
3,Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7
4,Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [14]:
jb.bond.set_index('Film').reset_index(drop=False).head()

,Film,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
0,Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
1,From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
2,Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
3,Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7
4,Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [15]:
jb.bond.set_index('Film').reset_index(drop=True).head()

   Year         Actor       Director  Box Office  Budget  Bond Actor Salary
0  1962  Sean Connery  Terence Young       448.8     7.0                0.6
1  1963  Sean Connery  Terence Young       543.8    12.6                1.6
2  1964  Sean Connery   Guy Hamilton       820.4    18.6                3.2
3  1965  Sean Connery  Terence Young       848.1    41.9                4.7
4  1967   David Niven     Ken Hughes       315.0    85.0                NaN

In [17]:
jb.bond.set_index('Film').set_index('Year').head()

             Actor       Director  Box Office  Budget  Bond Actor Salary
Year
1962  Sean Connery  Terence Young       448.8     7.0                0.6
1963  Sean Connery  Terence Young       543.8    12.6                1.6
1964  Sean Connery   Guy Hamilton       820.4    18.6                3.2
1965  Sean Connery  Terence Young       848.1    41.9                4.7
1967   David Niven     Ken Hughes       315.0    85.0                NaN

In [16]:
jb.bond.set_index('Film').reset_index(drop=False).set_index('Year').head()

,Film,Actor,Director,Box Office,Budget,Bond Actor Salary
Year,,,,,,
1962,Dr. No,Sean Connery,Terence Young,448.8,7.0,0.6
1963,From Russia with Love,Sean Connery,Terence Young,543.8,12.6,1.6
1964,Goldfinger,Sean Connery,Guy Hamilton,820.4,18.6,3.2
1965,Thunderball,Sean Connery,Terence Young,848.1,41.9,4.7
1967,Casino Royale,David Niven,Ken Hughes,315.0,85.0,NaN

## 03 Overwrite Multiple Values in a DataFrame

In [27]:
jb = utils.JamesBond()  # James Bond instance
jb.bond.head()

,Film,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
0,Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
1,From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
2,Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
3,Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7
4,Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [28]:
mask_sean_connery = jb.bond[jb.ACTOR] == 'Sean Connery'
mask_sean_connery.head(10)

0     True
1     True
2     True
3     True
4    False
5     True
6    False
7     True
8    False
9    False
Name: Actor, dtype: bool

In [29]:
jb.bond.loc[mask_sean_connery, jb.ACTOR]

0     Sean Connery
1     Sean Connery
2     Sean Connery
3     Sean Connery
5     Sean Connery
7     Sean Connery
13    Sean Connery
Name: Actor, dtype: object

In [ ]:
new_actor_name = 'Sir Sean Connery'
jb.bond.loc[mask_sean_connery, jb.ACTOR] = new_actor_name
jb.bond.head(10)

In [31]:
# The same can be done with replace method
jb = utils.JamesBond()  # James Bond instance
jb.bond[jb.ACTOR].replace('Sean Connery', new_actor_name).head(10)

0    Sir Sean Connery
1    Sir Sean Connery
2    Sir Sean Connery
3    Sir Sean Connery
4         David Niven
5    Sir Sean Connery
6      George Lazenby
7    Sir Sean Connery
8         Roger Moore
9         Roger Moore
Name: Actor, dtype: object

In [32]:
jb.bond[jb.ACTOR] = jb.bond[jb.ACTOR].replace('Sean Connery', new_actor_name)
jb.bond.head(10)

,Film,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
0,Dr. No,1962,Sir Sean Connery,Terence Young,448.8,7.0,0.6
1,From Russia with Love,1963,Sir Sean Connery,Terence Young,543.8,12.6,1.6
2,Goldfinger,1964,Sir Sean Connery,Guy Hamilton,820.4,18.6,3.2
3,Thunderball,1965,Sir Sean Connery,Terence Young,848.1,41.9,4.7
4,Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN
5,You Only Live Twice,1967,Sir Sean Connery,Lewis Gilbert,514.2,59.9,4.4
6,On Her Majesty's Secret Service,1969,George Lazenby,Peter R. Hunt,291.5,37.3,0.6
7,Diamonds Are Forever,1971,Sir Sean Connery,Guy Hamilton,442.5,34.7,5.8
8,Live and Let Die,1973,Roger Moore,Guy Hamilton,460.3,30.8,NaN
9,The Man with the Golden Gun,1974,Roger Moore,Guy Hamilton,334.0,27.7,NaN

## 04 Rename Index Labels or Columns in a DataFrame

In [33]:
jb = utils.JamesBond()  # James Bond instance
jb.bond.head()

,Film,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
0,Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
1,From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
2,Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
3,Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7
4,Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [37]:
# Rename Year column to Release Year
jb.bond = jb.bond.rename(columns={'Year': 'Release Year'})
jb.bond.head()

,Film,Release Year,Actor,Director,Box Office,Budget,Bond Actor Salary
0,Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
1,From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
2,Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
3,Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7
4,Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [39]:
# Set index to Film
jb.bond = jb.bond.set_index('Film')
jb.bond.head()

,Release Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [40]:
# Rename Dr. No to Doctor No
jb.bond = jb.bond.rename(index={'Dr. No': 'Doctor No'})
jb.bond.head()

,Release Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Doctor No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

## 05 The nsmallest and nlargest Methods

In [13]:
jb = utils.JamesBond()  # James Bond instance
jb.bond.head()

,Film,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
0,Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
1,From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
2,Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
3,Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7
4,Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [14]:
jb.bond[jb.BOX_OFFICE] = jb.bond[jb.BOX_OFFICE].sort_values(ascending=False)
jb.bond.head()

,Film,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
0,Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
1,From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
2,Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
3,Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7
4,Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [17]:
jb.bond = jb.bond.sort_values(by=jb.BOX_OFFICE, ascending=False).head()

In [18]:
jb.bond.head()

,Film,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
24,Skyfall,2012,Daniel Craig,Sam Mendes,943.5,170.2,14.5
3,Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7
2,Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
26,No Time to Die,2021,Daniel Craig,Cary Joji Fukunaga,774.2,301.0,25.0
25,Spectre,2015,Daniel Craig,Sam Mendes,726.7,206.3,30.0

In [20]:
jb.bond[jb.BOX_OFFICE].nlargest(5)

24    943.5
3     848.1
2     820.4
26    774.2
25    726.7
Name: Box Office, dtype: float64

In [21]:
jb.bond.nlargest(5, jb.BOX_OFFICE).head()

,Film,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
24,Skyfall,2012,Daniel Craig,Sam Mendes,943.5,170.2,14.5
3,Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7
2,Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
26,No Time to Die,2021,Daniel Craig,Cary Joji Fukunaga,774.2,301.0,25.0
25,Spectre,2015,Daniel Craig,Sam Mendes,726.7,206.3,30.0

## 06 The apply Method with DataFrames

In [22]:
jb = utils.JamesBond()  # James Bond instance
jb.bond.head()

,Film,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
0,Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
1,From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
2,Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
3,Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7
4,Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

## 07 Coding Challenge

### 01 Data Loading

In [2]:
l = utils.NFL()  # NFL instance
l.nfl.head()

             Name                  Team Position   Birthday   Salary
0    Tremon Smith   Philadelphia Eagles       RB 1996-07-20   570000
1  Shawn Williams    Cincinnati Bengals       SS 1991-05-13  3500000
2     Adam Butler  New England Patriots       DT 1994-04-12   645000
3     Derek Wolfe        Denver Broncos       DE 1990-02-24  8000000
4       Jake Ryan  Jacksonville Jaguars      OLB 1992-02-27  1000000

### 02 Challenges

In [4]:
# 3 How can we count the number of players per team in this data set?
l.nfl[l.TEAM].value_counts().sort_values(ascending=False).head()

Team
New York Jets          58
Kansas City Chiefs     56
Washington Redskins    56
New Orleans Saints     55
San Francisco 49Ers    55
Name: count, dtype: int64

In [5]:
# 4 Who are the five highest-paid players?
l.nfl.nlargest(5, l.SALARY)

                 Name                  Team Position   Birthday    Salary
180      Kirk Cousins     Minnesota Vikings       QB 1988-08-19  27500000
905    Marcus Mariota      Tennessee Titans       QB 1993-10-30  20922000
1623   Jameis Winston  Tampa Bay Buccaneers       QB 1994-01-06  20922000
1343       Derek Carr       Oakland Raiders       QB 1991-03-28  19900000
150   Jimmy Garoppolo   San Francisco 49Ers       QB 1991-11-02  17200000

In [10]:
l.nfl.nlargest(5, l.SALARY)[[l.NAME, l.SALARY]]

                 Name    Salary
180      Kirk Cousins  27500000
905    Marcus Mariota  20922000
1623   Jameis Winston  20922000
1343       Derek Carr  19900000
150   Jimmy Garoppolo  17200000

In [7]:
l.nfl[l.SALARY].nlargest(5)

180     27500000
905     20922000
1623    20922000
1343    19900000
150     17200000
Name: Salary, dtype: int64

In [11]:
# 5 How can we sort the data set first by teams in alphabetical order and then by salary in descending order?
l.nfl.sort_values(by=[l.TEAM, l.SALARY], ascending=[True, False]).head()

                  Name               Team Position   Birthday    Salary
1577    Chandler Jones  Arizona Cardinals      OLB 1990-02-27  16500000
669   Patrick Peterson  Arizona Cardinals       CB 1990-07-11  11000000
1361  Larry Fitzgerald  Arizona Cardinals       WR 1983-08-31  11000000
1594     David Johnson  Arizona Cardinals       RB 1991-12-16   5700000
948        Justin Pugh  Arizona Cardinals        G 1990-08-15   5000000

In [ ]:
# 6 Who is the oldest player on the New York Jets roster, and what is his birthday?

In [12]:
l.nfl[l.TEAM].unique()

array(['Philadelphia Eagles', 'Cincinnati Bengals',
       'New England Patriots', 'Denver Broncos', 'Jacksonville Jaguars',
       'Dallas Cowboys', 'Miami Dolphins', 'Buffalo Bills',
       'Atlanta Falcons', 'Cleveland Browns', 'Minnesota Vikings',
       'Tampa Bay Buccaneers', 'Los Angeles Chargers',
       'Washington Redskins', 'Tennessee Titans', 'Chicago Bears',
       'Houston Texans', 'Arizona Cardinals', 'Baltimore Ravens',
       'New Orleans Saints', 'Detroit Lions', 'Pittsburgh Steelers',
       'San Francisco 49Ers', 'New York Giants', 'New York Jets',
       'Green Bay Packers', 'Seattle Seahawks', 'Indianapolis Colts',
       'Carolina Panthers', 'Oakland Raiders', 'Los Angeles Rams',
       'Kansas City Chiefs'], dtype=object)

In [ ]:
mask_nyj = l.nfl[l.TEAM] == 'New York Jets'
l.nfl[mask_nyj].sort_values(by=l.BIRTHDAY).head()

                  Name           Team Position   Birthday   Salary
888         Ryan Kalil  New York Jets        C 1985-03-29  2400000
1448    Steve McLendon  New York Jets       NT 1986-01-03  1500000
1272  Albert McClellan  New York Jets      ILB 1986-06-04   805000
498   Demaryius Thomas  New York Jets       WR 1987-10-25  1200000
1237      Bilal Powell  New York Jets       RB 1988-10-04   930000

In [21]:
# The same with nsmallest
l.nfl[mask_nyj].nsmallest(1, l.BIRTHDAY)[[l.NAME, l.BIRTHDAY]]

           Name   Birthday
888  Ryan Kalil 1985-03-29

In [22]:
# The same with idxmin
l.nfl.loc[mask_nyj, :].loc[l.nfl.loc[mask_nyj, l.BIRTHDAY].idxmin(), [l.NAME, l.BIRTHDAY]]

Name                 Ryan Kalil
Birthday    1985-03-29 00:00:00
Name: 888, dtype: object